{
  "main": {
    "name":"Raham Arshad",
    "occupation":"Computer Science Student",
    "description":"Welcome to my portfolio",
    "image":"arham-arshad.jpg",
    "bio":"Hello! I'm Raham, a Bachelor of Applied Computer Science student with a minor in management. My education uniquely combines tech skills with business insights. I specialize in web development, proficient in Java, JavaScript, and Python. My portfolio showcases my journey in creating user-friendly, efficient websites. I'm passionate about leveraging my technical expertise and management knowledge to build impactful digital solutions.",
    "email": "raham.arshad@dal.ca",
    "address":{
      "city":"Halifax",
      "state":"Nova Scotia"
    },
    "website": "https://rahamarshad.netlify.app",
    "resumedownload":"Arham_Arshad_Resume-Portfolio.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"www.linkedin.com/in/rahamarshad",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/rahamarshad",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Dalhousie University",
        "degree":"Bachelors in Computer Science & Management",
        "timeline":"September 2022 - August 2026",
        "description":"In my degree, I've learned concepts in Interdisciplinary Management, Micro-Organizational Behaviour, Fundamentals of Computer Programming,\nObject-Oriented Programming,\nPrinciples of Software Development,\nData Structures and Algorithms,\nDesign for User Experience,\nBasic Organization of Computer Systems,\nFile and Database Management\n"
      }
    ],
    "work":[
      {
        "company":"Colliers International",
        "title":"Business Intelligence Analyst",
        "years":"June 2021 - August 2022",
        "description":"Advanced experience Power BI development and administration - Advanced experience building Analysis Services reporting models - Advanced proficiency in Developing visual reports, dashboards and KPI scorecards using Power BI desktop - Advanced level knowledge and experience connecting to data sources, importing data and transforming data (ETL) for Business Intelligence using SSIS packages and stored procedures - Advanced proficiency in building Dataflows to replace Analysis Services tabular models - Proficient in creating DAX queries in Power BI desktop - Expertise in using advance level calculations on the data set - Experience developing custom Power BI visuals using JSON files - Adept in developing, publishing and scheduling Power BI reports as per business requirements - Able to properly understand the business requirements and develop data models accordingly - Responsible for design methodology and project documentation - Knowledge and experience in prototyping, designing, and requirement analysis - Able to integrate Power BI reports into other applications using embedded analytics like Power BI Service (SaaS), or by API automation - Excellent in analytical thinking for translating data into informative visuals and reports - Knowledge and skills in secondary tools such as Microsoft Azure, SQL data warehouse, Visual Studio - Software languages: SQL, Python, DAX, M language"
      },
      {
        "company":"ACM, Association for Computing Machinery",
        "title":"Web Application Developer Intern",
        "years":"January 2021 - April 2021",
        "description":"- Conducted extensive research on peer reviews and determined problems associated with peer reviews in scholarly journals such as bias and misconduct.\n- Developed, verified and validated a regression model using R that helps determine how the process of peer review could be structured to overcome the aforementioned problems.\n- Created an interactive web application using JavaScript to allow authors and reviewers at ACM Digital Library to generate a dynamic checklist based on each type of empirical study in software engineering. \n- Maintained and documented the quality of code with accordance to software development practices such as commenting, indentation, debugging and refactoring. \n- Produced and delivered a technical report detailing the entire project and areas of future research at a workshop about software engineering hosted by Evaluation and Assessment in Software Engineering (EASE)."
      },
      {
        "company":"Natural Sciences and Engineering Research Council of Canada (NSERC)",
        "title":"Research Analyst Intern ",
        "years":"May 2020 - September 2020",
        "description":"Conducted extensive research on Agile software development predicting correlations between exogenous and endogenous variables using mathematical regression models in R.\n Brought forth a strong understanding of research methods and data analysis by performing case meta-analysis and statistical analysis on case studies that used Scrum practices.\n \n Documented a research paper for publishing detailing the entire project.\n Organized and prioritized work to complete tasks in timely, efficient manner."
      },
      {
        "company":"Dalhousie University",
        "title":"Teaching Assistant",
        "years":"September 2019 - Present",
        "description":"Assisted professor by conducting tutorials and labs while also aiding students with their assignments focusing on HTML, CSS and JavaScript.\n Graded labs and assignments along with providing weekly discussions with students.\n Worked with students individually and provided extra support at the faculty’s Learning Center.\n Other Duties include grading weekly quizzes, workbooks, essays and term project reports."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"90%"
      },
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Python",
        "level":"65%"
      },
      {
        "name":"JavaScript",
        "level":"60%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"85%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Halifax Explorer",
        "category":"An engaging and user-friendly website to facilitate exploration of activities and eateries in Halifax,",
        "image":"fementity.png",
        "url":"https://github.com/CSCIX691DAL/fementity"
      },
      {
        "title":"My Personal Website ",
        "category":"Developed a portfolip website using ReactJS",
        "image":"portfolio.png",
        "url":"https://github.com/arhamarshad1/Portfolio"
      },
      {
        "title":"CSCI X691 Course Website for Dalhousie University",
        "category":"Designed and set up CI/CD for computer science course website.",
        "image":"X691Website.png",
        "url":"https://github.com/CSCIX691DAL/CSCIX691-website"
      },
      {
        "title":"Canadian Way Driver Training Website ",
        "category":"Worked with a client to redesign a driver training website and implement a backend system as well as continous deploymnet/continuous integration",
        "image":"cwdt.png",
        "url":"https://github.com/CSCIX691DAL/cwdt"
      }
    ]
  }
}
